#include <iostream>
#include "cpp1.h"
#include "cpp2.h"
#include "cpp3.h"
#include "cpp4.h"




using namespace std;

/*
*   Функция для ввода данных в терминал
*   При вызове функции нужно указать получаемые данные в скобках,
*   т.е. readValue<int>() - получить число.
*   prompt - текст перед вводом
*/
template <typename T>
T readValue(const char* prompt) {
    T value;
    cout << prompt;
    while (true) {
        cin >> value;
        if (cin.fail()) {
            cout << "Incorrect input. Enter new value: ";
            cin.clear();
            // numeric_limits<streamsize> это предел количества знаков в streamsize (вернёт число)
            // нужно чтобы очистить максимальное количество оставшихся символов в буфере до новой строки
            cin.ignore(numeric_limits<streamsize>::max(), '\n');
        }
        else {
            cin.ignore(numeric_limits<streamsize>::max(), '\n');
            return value;
        }
    }
}

int main()
{
    while (true) {
        setlocale(LC_ALL, "russian");
        system("cls");
        
        cout << "____________________________________________________________________________________" << "\n";
        cout << "|                                 Меню :                                           |"<< "\n";       
        cout << "| 1) Лабораторная работа 1 - Работа с паметью                                      |" << "\n";
        cout << "| 2) Лабораторная работа 2 - Сортировки массивов                                   |" << "\n";
        cout << "| 3) Лабораторная работа 3 - Работа с двумерными массивами                         |" << "\n";
        cout << "| 4) Лабораторная работа 4 - Работа со строками                                    |" << "\n";
        cout << "| 0) Выход из программы                                                            |" << "\n";
        cout << "|__________________________________________________________________________________|" << "\n";
        int choice = readValue<int>("Type a number to continue: ");
        cout << endl;
        switch (choice) {
        case 0:
            cout << "                         Спасибо за просмотр" << "\n";
            cout << "                           попугай вторник" << "\n";

            cout << "___________________________________________$$$$$$$$$$$$" << "\n";
            cout << "________________________________________$$$$$$$$$_ __$$$" << "\n";
            cout << "____________________________________$$$$$$$$_____( &)_$$$$" << "\n";
            cout << "________________________________$$$$$$$$$$________ ____$$$$" << "\n";
            cout << "_____________________________$$$$$$$$$$$$$$$____§ §§§_____$" << "\n";
            cout << "___________________________$$$$$$$$$$$$$$$$$$§§ ?§_§§§_____$" << "\n";
            cout << "_________________________$$$$$$$$$$$$$$$$$$$$$§§ §§§_§____" << "\n";
            cout << "______________________$$$$$$$$$$$$$$$$$$_$$$$___§ §§__§_$" << "\n";
            cout << "____________________$$$$$$$$$$$$$_$$$$$$$$_$______ __§" << "\n";
            cout << "___________________$$$$$$$$$$$$$$$$$$$$$$$$_$" << "\n";
            cout << "_________________$$$$$$$$$_$$$$$$$$$$$$$$$$_$" << "\n";
            cout << "_______________$$$$$$$$_§$$$$$$$$$§$$$$$$$$_$" << "\n";
            cout << "_____________$$$$$$$_$$§§§$$$§$$§§$$$$§§$_ $$$" << "\n";
            cout << "____________$$$$$$_§§§$$§§$$§§§$$§§$$§ ?$_$$$" << "\n";
            cout << "___________$$$$$_$§§§$$$$§§§$$$§§§§§$$_ $$$$$" << "\n";
            cout << "__________$$$$$_§§§§§§$$§§§$$§§§§§§ §_$$$$$$" << "\n";
            cout << "_________$$$$_§§0§§§§§§§§§§§§§§§ ?_$$$$$$$" << "\n";
            cout << "________$$$_000§§§00§§§§§000§00§_$$$$$$" << "\n";
            cout << "________$$_0000§§0000§§§00§0§_$$$$$$" << "\n";
            cout << "_______$_0000§§00000§0000_$$$$$$$" << "\n";
            cout << "_____§§00000§000§0000_$$$$$$$$" << "\n";
            cout << "___§00000§0000000_$$$$$$$$$$" << "\n";
            cout << "___000§00000§_§§§§$$$$$$$$$$$$$___......" << "\n";
            cout << "___000§00000§_§§§§$$$$$$$$$$$$$___......" << "\n";
            cout << "_000§0_§§§§§§$$$$$$$_§000_$$$§§§_000000 0000000000000" << "\n";
            cout << "00____§§§§§$$$$$$$_§§00000_$§§§_00000000 000000000000" << "\n";
            cout << "______§§§§$$$$$$$_§§§_’’______§§§__???’" << "\n";
            cout << "_____§§§$$$$$$" << "\n";
            cout << "____§§$$$$$$$" << "\n";
            cout << "___$$$$$$$$" << "\n";
            cout << "__$$$$$$$$" << "\n";
            cout << "_$$$$$$$$" << "\n";
            cout << "$$$$$$$$" << "\n";
            cout << "$$$$$$$" << "\n";
            cout << "$$$$$$" << "\n";
            cout << "$$$$" << "\n";
            return 0;
        case 1:
            cpp1main();
            system("pause");
            break;
        case 2:
            
            cpp2main();
            system("pause");
            break;
        case 3:
            system("cls");
            system("pause");
            system("cls");
            cpp3main();
            break;
        case 4:
            system("cls");
            cpp4main();
            system("pause");
            break;
        default:
            cout << "\nProject with number " << choice << " does not exist." << endl;
            system("pause");
            break;
        }
    }
}
